# üîç Pandas Inspection - Load in the Data

## üìÇ Loading Data into Pandas

First, let's load a dataset to work with. We'll use a sample data science jobs dataset.

In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

d:\anaconda3\envs\haroun_env\Lib\site-packages\requests\__init__.py:86: RequestsDependencyWarning: Unable to find acceptable character detection dependency (chardet or charset_normalizer).
  warnings.warn(

# üìä Descriptive Statistics with describe()

## üìù Notes

- For a basic overview we'll be using `describe()`
- It gets the following (for columns with numeric data):
  - **count**
  - **mean**
  - **std**
  - **min**
  - **max**
- Great for getting a quick overview of the basic stats for the table
- It automatically skips NaN values

## üí° Example

Use `describe()` on our DataFrame.

In [2]:
df.describe()

       salary_year_avg  salary_hour_avg
count     22003.000000     10662.000000
mean     123286.274072        47.016598
std       48312.449482        21.890738
min       15000.000000         8.000000
25%       90000.000000        27.500000
50%      115000.000000        45.980000
75%      150000.000000        61.159996
max      960000.000000       391.000000

You can also use it on individual columns. If we just wanted to look at `salary_year_avg` then we'd do:

In [3]:
df['salary_year_avg'].describe()

count     22003.000000
mean     123286.274072
std       48312.449482
min       15000.000000
25%       90000.000000
50%      115000.000000
75%      150000.000000
max      960000.000000
Name: salary_year_avg, dtype: float64

# üìà Common Data Analysis Methods

## üìù Notes

But there are other methods like:

- `df.sum()` - Sum of values
- `df.cumsum()` - Cumulative sum of values
- `df.min()`/`df.max()` - Minimum/maximum values
- `df.idxmin()`/`df.idxmax()` - Indexes of minimum/maximum value
- `df.mean()` - Mean of values
- `df.median()` - Median of values
- `df.mode()` - Mode of the values
- `series.value_counts()` - Counts of unique values for a Series (aka a column)
  - Typically used for counting unique occurrences within a single column
  - It's not applicable to an entire DataFrame without specifying a column

Depending on the method, you can apply it directly to a DataFrame or a Series.

## üí° Examples

Let's get the count of the values in each column within the entire DataFrame.

In [4]:
df.count()

job_title_short          785741
job_title                785740
job_location             784696
job_via                  785733
job_schedule_type        773074
job_work_from_home       785741
search_location          785741
job_posted_date          785741
job_no_degree_mention    785741
job_health_insurance     785741
job_country              785692
salary_rate               33067
salary_year_avg           22003
salary_hour_avg           10662
company_name             785723
job_skills               668704
job_type_skills          668704
dtype: int64

This is good to get a general overview of the DataFrame but it isn't that useful to us right now. Let's do some counts on specific columns:

Get the mode of the `'salary_year_avg'` column.

In [5]:
df['salary_year_avg'].mode()

0    90000.0
Name: salary_year_avg, dtype: float64

Now we are going to get the index value of the max value of `salary_year_avg`.

In [6]:
df['salary_year_avg'].idxmax()

554784

It gave us the index (row) = 357614. Remember how to get a row by the index number? We'll use `iloc` and inspect this.

It looks correct based on the maximum value we saw when using `describe()`.

In [7]:
df.iloc[357614]

job_title_short                                          Data Analyst
job_title                Data Analyst | Financial Sector | Co. Dublin
job_location                                          Dublin, Ireland
job_via                                               via Recruit.net
job_schedule_type                                           Full-time
job_work_from_home                                              False
search_location                                               Ireland
job_posted_date                                   2023-01-17 23:30:25
job_no_degree_mention                                            True
job_health_insurance                                            False
job_country                                                   Ireland
salary_rate                                                      None
salary_year_avg                                                   NaN
salary_hour_avg                                                   NaN
company_name                                          FRS Recruitment
job_skills                                                       None
job_type_skills                                                  None
Name: 357614, dtype: object

In [8]:
df['job_title_short'].value_counts()

job_title_short
Data Analyst                 196075
Data Engineer                186241
Data Scientist               172286
Business Analyst              49063
Software Engineer             44929
Senior Data Engineer          44563
Senior Data Scientist         36957
Senior Data Analyst           29216
Machine Learning Engineer     14080
Cloud Engineer                12331
Name: count, dtype: int64

# üìä Aggregation with GroupBy()

## üìù Notes

- Use `groupby` to group your DataFrame by the unique values in a specific column
- Lets you perform aggregation (e.g. mean, sum) on the grouped data

### Aggregations you can perform:
- **`mean()`**: Computes the mean of the groups
- **`sum()`**: Calculates the sum of the group values
- **`median()`**: Finds the median of each group
- **`min()` and `max()`**: Determine the minimum and maximum values within each group

### Counts:
- **`count()`**: Counts the number of non-NA/null entries in each group
- **`size()`**: Returns the size of each group (including NA/null values)
- **`std()` and `var()`**: Calculate the standard deviation and variance of groups
- **`first()` and `last()`**: Get the first and last row of each group
- **`unique()`**: Counts the number of unique non-NA/null values in each group

## üí° Examples

If we want to find the average yearly salary by `job_title_short`.

In [9]:
df.groupby('job_title_short')['salary_year_avg'].mean()

job_title_short
Business Analyst              91082.612833
Cloud Engineer               111268.453846
Data Analyst                  93841.907854
Data Engineer                130125.604250
Data Scientist               135988.837171
Machine Learning Engineer    126774.315972
Senior Data Analyst          113911.363665
Senior Data Engineer         145840.611624
Senior Data Scientist        154206.292996
Software Engineer            113393.760054
Name: salary_year_avg, dtype: float64

What about the median of the salary by job title short?

In [10]:
df.groupby('job_title_short')['salary_year_avg'].median()

job_title_short
Business Analyst              85000.0
Cloud Engineer                90000.0
Data Analyst                  90000.0
Data Engineer                125000.0
Data Scientist               127500.0
Machine Learning Engineer    106415.0
Senior Data Analyst          111175.0
Senior Data Engineer         147500.0
Senior Data Scientist        155500.0
Software Engineer             99150.0
Name: salary_year_avg, dtype: float64

# üéØ Aggregation with agg()

## üìù Notes

- `agg()` lets you apply multiple functions at once
- You can pass a list of functions to `agg()` to apply them all to the grouped data, or a dictionary to apply specific functions to specific columns

## üí° Example

For each job title (`job_title_short`) let's get the minimum and maximum values for the salary.

In [11]:
df.groupby('job_title_short')['salary_year_avg'].agg(['min','max'])

                               min       max
job_title_short
Business Analyst           16500.0  387460.0
Cloud Engineer             42000.0  280000.0
Data Analyst               25000.0  650000.0
Data Engineer              15000.0  525000.0
Data Scientist             27000.0  960000.0
Machine Learning Engineer  30000.0  325000.0
Senior Data Analyst        30000.0  425000.0
Senior Data Engineer       35000.0  425000.0
Senior Data Scientist      45000.0  890000.0
Software Engineer          28000.0  375000.0